app/Http/Controllers/Admin/BlogController.php

    public function index()
    {
        $categories = Category::all(); // Fetch all categories
---
select * from `categories`