app/Http/Controllers/Admin/PlanSubscriptionController.php

select count(*) as aggregate from `plan_subscriptions`
select * from `plan_subscriptions` where `plan_name` like '%%' order by `id` desc limit 25 offset 0
---
    public function getPlanLists(Request $request)
    {
        //  dd($request);
        if (isset($_GET['search']['value'])) {
            $search = $_GET['search']['value'];
        } else {
            $search = '';
        }
        if (isset($_GET['length'])) {
            $limit = $_GET['length'];
        } else {
            $limit = 10;
        }
        if (isset($_GET['start'])) {
            $offset = $_GET['start'];
        } else {
            $offset = 0;
        }
        $orderType = $_GET['order'][0]['dir'];
        $nameOrder = $_GET['columns'][$_GET['order'][0]['column']]['name'];
        $total = PlanSubscription::count();
        $planSubscription = PlanSubscription::where('plan_name', 'like', '%' . $search . '%')
            ->offset($offset)->limit($limit)
            ->orderBy('id', $orderType)
            ->get();